Repository: eaton/postblock
Catalog: translations/*.po
Languages: hu

source: Create !type
hu: !type létrehozása

source: Content types
hu: Tartalomtípusok

source: Number of blocks
hu: Blokkok száma

source: Show
hu: Megjelenítés

source: Block name
hu: Blokknév

source: Hide
hu: Elrejt

source: Post block
hu: Beküldő blokk

source: Provides a block with themable links to create nodes of specific content types
hu: Egy sminkelhető hivatkozásokat adó blokkot szolgáltat a megadott tartalomtípusok beküldéséhez.

source: The number of Post Blocks you want. Must be between 1 and 99.
hu: A szükséges beküldő blokkok száma. Értékének 1 és 99 között kell lennie.

source: 'Number of blocks' must be a number.
hu: A „blokkok számának” számnak kell lennie.

source: 'Number of blocks' must be between 1 & 99 (inclusive).
hu: A „blokkok számának” 1 és 99 között kell lennie.

source: A custom name for the block to help distinguish from other Post Block blocks.
hu: Egy egyedi név a blokk számára, mely segít a más beküldő blokkoktól való megkülönböztetésben.

source: NOTE: This name is only used on the Blocks administration page (admin/build/block) and is never shown in the block itself.
hu: Megjegyzés: Ez a név csak a blokkok adminisztrációs oldalán kerül felhasználásra (admin/build/block), és soha nem jelenik meg a blokkban.

source: Selection method
hu: Kiválasztási mód

source: Show: Display only the selected content types. New content types will need to be enabled manually.
hu: Megjelenít: Csak a kijelölt tartalomtípusokat jeleníti meg. Az új tartalomtípusokat kézzel kell engedélyezni.

source: Hide: Display all except the selected content types. New content types will be enabled automatically.
hu: Elrejt: Megjelenít mindent, kivéve a kijelölt tartalomtípusokat. Az új tartalomtípusok automatikusan engedélyezve lesznek.

source: NOTE: Content type links displayed in the Post Block will only be visible to users with the 'create [content type]' permission.
hu: Megjegyzés: A beküldő blokkban megjelenő tartalomtípus hivatkozások csak azoknak a felhasználóknak jelennek meg, akik rendelkeznek „[content type] létrehozása” jogosultsággal.

source: Post Content
hu: Tartalom beküldése

source: administer postblock
hu: postblock adminisztrációja

source: Configure Post Block
hu: Beküldő blokk beállítása

source: Post Block
hu: Beküldő blokk

source: Content types selected here will be shown or hidden depending on the 'Selection method' above. The order of these content types represent the order the links will appear in the Post Block.
hu: A fennt megadott kiválasztási módtól függően az itt kiválasztott tartalomtípusok fognak megjelenni vagy elrejtődni. A tartalomtípusok sorrendje azt határozza meg, hogy a hivatkozások milyen sorrendben jelennek meg a beküldő blokkban.
